apps/backend/tests/profile_sync_load.yml
config:
  target: "http://localhost:5010"
  phases:
    - name: "Intense Profile Sync Test"
      duration: 60
      arrivalRate: 20
  
  defaults:
    headers:
      Content-Type: "application/json"

  ensure:
    p95: 500
    maxErrorRate: 1

scenarios:
  - name: "Login and Fetch Profile Identity"
    flow:
      - post:
          url: "/api/auth/login"
          json:
             email: "loadtest-user@ichange.app"
             password: "Password123"
          capture:
            - json: "$.accessToken"
              as: "token"
            - json: "$.user._id"
              as: "userId"
      - get:
          url: "/api/user/profile"
          headers:
            Authorization: "Bearer {{ token }}"
      - think: 1
      - get:
          url: "/api/auth/me"
          headers:
            Authorization: "Bearer {{ token }}"